#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/managedkube/kubernetes-ops-staging-25-eks-cluster-autoscaler/runs/run-s6qEf9B78RoQZdtx

Waiting for the plan to start...

Terraform v0.15.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster-autoscaler.aws_iam_policy.cluster_autoscaler will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn         = (known after apply)
      + description = "EKS cluster-autoscaler policy for cluster dev"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cluster-autoscaler-dev"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "clusterAutoscalerAll"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled = [
                                  + "true",
                                ]
                              + autoscaling:ResourceTag/kubernetes.io/cluster/dev         = [
                                  + "owned",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "clusterAutoscalerOwn"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.cluster-autoscaler.module.cluster-autoscaler.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                awsRegion: us-east-1
                
                rbac:
                  create: true
                  serviceAccount:
                    # This value should match local.k8s_service_account_name in locals.tf
                    name: cluster-autoscaler-aws-cluster-autoscaler
                    annotations:
                      # This value should match the ARN of the role created by module.iam_assumable_role_admin in irsa.tf
                      eks.amazonaws.com/role-arn: "arn:aws:iam::937803775366:role/cluster-autoscaler-dev"
                
                autoDiscovery:
                  clusterName: dev
                  enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "9.9.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster-autoscaler.module.iam_assumable_role_admin.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + oidc.eks.us-east-1.amazonaws.com/id/7DAD4BC728B86D1D03918ECB33F6CAC4:sub = [
                                  + "system:serviceaccount:kube-system:cluster-autoscaler-aws-cluster-autoscaler",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::937803775366:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7DAD4BC728B86D1D03918ECB33F6CAC4"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cluster-autoscaler-dev"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cluster-autoscaler.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cluster-autoscaler-dev"
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>
*Pusher: @sekka1, Action: `pull_request`*